CREATE VIEW [Актуальные акции] AS
	SELECT Название, Описание, [Процент скидки], [Условия выполнения], [Минимальная сумма], [Дни недели]
	FROM Акция
	WHERE (([Дата начала действия] < GETDATE() and [Дата окончания действия] > GETDATE())
		and ([Время начала действия] < CAST(GETDATE() as time) and [Время окончания действия] > CAST(GETDATE()as time)))
		or (([Дата начала действия] < GETDATE() and [Дата окончания действия] > GETDATE())
		and (([Время начала действия] is null) and [Время окончания действия] is null))
		or (([Дата начала действия] is null and [Дата окончания действия] is null)
		and (([Время начала действия] < CAST(GETDATE()as time)) and [Время окончания действия] > CAST(GETDATE()as time)))
		
DROP VIEW [Актуальные акции]
--------------------------------------------------------------------------------------------------------------------
CREATE VIEW [График работы на неделю] AS
	SELECT (Фамилия + ' ' + Имя) as Сотрудник, Должность, CONVERT(CHAR(5), [Время начала], 108) as [Время начала], 
		CONVERT(CHAR(5), [Время окончания], 108) as [Время окончания], Дата, Название
	FROM [График работы] as gr JOIN Сотрудник as s ON gr.Сотрудник = s.id
		JOIN Смена as sm ON gr.Смена = sm.id JOIN Бар b ON gr.Бар = b.id
	WHERE DATEPART(WEEKDAY, Дата) > DATEPART(WEEKDAY, GETDATE()) and  DATEPART(WEEKDAY, Дата) < 7
--???????
SELECT DATEPART(WEEKDAY, GETDATE())
--------------------------------------------------------------------------------------------------------------------
CREATE VIEW [Свободные столы] AS
	SELECT 
		s.Номер AS [Номер стола],
		s.[Количество мест],
		s.Расположение,
		s.Этаж,
		s.Статус,
		b.Название AS [Название бара]
	FROM Стол s JOIN Бар b ON s.[id бара] = b.id
	WHERE s.Статус = 'Свободен'
--------------------------------------------------------------------------------------------------------------------
CREATE VIEW [Забронированные столы] AS
	SELECT [Номер стола], [Имя клиента], [Количество человек], s.Этаж, s.Статус, bar.Название
	FROM Бронь as b JOIN Стол as s ON b.[Номер стола] = s.Номер JOIN Бар as bar ON s.[id бара] = bar.id
	WHERE [Дата бронирования] = GETDATE()

DROP VIEW [Забронированные столы]
--------------------------------------------------------------------------------------------------------------------




CREATE VIEW [Текущие заказы] AS
	SELECT 
		z.Номер AS [Номер заказа],
		s.Имя + ' ' + s.Фамилия AS [Сотрудник],
		st.Номер AS [Номер стола],
		z.[Дата и время оформления],
		z.Статус,
		z.Итого
	FROM Заказ z JOIN Сотрудник s ON z.[id сотрудника] = s.id JOIN Стол st ON z.Стол = st.Номер
WHERE z.Статус = 'Принят' OR z.Статус = 'Готовится';


CREATE VIEW [Анализ продаж напитков] AS
SELECT 
    n.Название AS [Напиток],
    COUNT(szn.Количество) AS [Количество продаж],
    SUM(szn.Стоимость) AS [Общая выручка]
FROM Напиток n JOIN [Состав заказа напитков] szn ON n.id = szn.Напиток
GROUP BY n.Название;



SELECT *
FROM [Занятость столов]

SELECT *
FROM Стол

CREATE VIEW [Анализ поставок] AS
SELECT 
    p.Название AS [Поставщик],
    COUNT(DISTINCT pn.Напиток) AS [Количество видов напитков],
    COUNT(DISTINCT pp.Продукт) AS [Количество видов продуктов],
    SUM(pn.Количество) AS [Общий объем напитков],
    SUM(pp.Количество) AS [Общий объем продуктов]
FROM Поставщик p LEFT JOIN [Поставка напитков] pn ON p.Название = pn.Поставщик 
	LEFT JOIN [Поставка продуктов] pp ON p.Название = pp.Поставщик
GROUP BY p.Название;

CREATE VIEW [Меню бара] AS
SELECT 
    b.Название AS [Название бара],
    tm.Название AS [Тип меню],
    m.Статус,
    m.Цена
FROM Бар b
	JOIN [Меню бара] mb ON b.id = mb.Бар
	JOIN Меню m ON mb.ТипМеню = m.ТипМеню
	JOIN ТипМеню tm ON m.ТипМеню = tm.id;

CREATE VIEW [Анализ работы сотрудников] AS
SELECT 
    s.Имя + ' ' + s.Фамилия AS [Сотрудник],
    s.Должность,
    COUNT(DISTINCT z.Номер) AS [Количество обработанных заказов],
    SUM(z.Итого) AS [Общая сумма заказов]
FROM Сотрудник s
JOIN Заказ z ON s.id = z.[id сотрудника]
GROUP BY s.Имя, s.Фамилия, s.Должность;

CREATE VIEW [Актуальные акции] AS
SELECT 
    a.Название,
    a.Описание,
    a.[Процент скидки],
    b.Название AS [Название бара],
    a.[Дата начала действия],
    a.[Дата окончания действия]
FROM Акция a
JOIN [Акции бара] ab ON a.Название = ab.Акция
JOIN Бар b ON ab.[id бара] = b.id
WHERE GETDATE() BETWEEN a.[Дата начала действия] AND a.[Дата окончания действия];
